In [1]:
import numpy

arreglo= numpy.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [5]:
import numpy as np
arreglo= np.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [7]:
import pandas as pd
df=pd.DataFrame(arreglo)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
df=pd.DataFrame(data=arreglo, index=["A","B","C"],columns=["D","E","F"])
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int32
 1   E       3 non-null      int32
 2   F       3 non-null      int32
dtypes: int32(3)
memory usage: 60.0+ bytes

In [21]:
df.shape

(3, 3)

In [25]:
df.describe()

         D    E    F
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [27]:
df.columns

Index(['D', 'E', 'F'], dtype='object')

In [29]:
df.index

Index(['A', 'B', 'C'], dtype='object')

In [33]:
df.loc["G"]=[11,12,13]
df

    D   E   F
A   1   2   3
B   4   5   6
C   7   8   9
G  11  12  13

In [35]:
df["H"]=[17,16,15,14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [41]:
df2=df[["E","H"]]
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

In [43]:
df3=df.iloc[0:2]
df3

   D  E  F   H
A  1  2  3  17
B  4  5  6  16

In [45]:
df.columns=["Columna1","Columna2","Columna3","Columna4"]
df

   Columna1  Columna2  Columna3  Columna4
A         1         2         3        17
B         4         5         6        16
C         7         8         9        15
G        11        12        13        14

In [49]:
df.rename(columns={"Columna1":"Column1"},inplace=True)
df

   Column1  Columna2  Columna3  Columna4
A        1         2         3        17
B        4         5         6        16
C        7         8         9        15
G       11        12        13        14

In [51]:
df.rename(index={"A":"Dato1"},inplace=True)
df

       Column1  Columna2  Columna3  Columna4
Dato1        1         2         3        17
B            4         5         6        16
C            7         8         9        15
G           11        12        13        14

In [53]:
df4=df.sort_values("Columna4",ascending=True)
df4

       Column1  Columna2  Columna3  Columna4
G           11        12        13        14
C            7         8         9        15
B            4         5         6        16
Dato1        1         2         3        17

In [55]:
df["Columna2"]>5

Dato1    False
B        False
C         True
G         True
Name: Columna2, dtype: bool

In [57]:
df[df["Columna2"]>5]

   Column1  Columna2  Columna3  Columna4
C        7         8         9        15
G       11        12        13        14

In [59]:
arreglos= np.array([["Bella", "Labrador","Café",56,24,"2013-07-01"],["Charlie", "Poodle","Negro",56,24,"2016_09_16"],["Lucy", "Chow Chow","Café",46,24,"2014-08-25"],["Cooper", "Schnauzer","Gris",49,17,"2011-12-11"],["Bernie", "San Bernardo","Blanco",77,74,"2018-02-27"]])
arreglos

array([['Bella', 'Labrador', 'Café', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '56', '24', '2016_09_16'],
       ['Lucy', 'Chow Chow', 'Café', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27']],
      dtype='<U12')

In [61]:
df= pd.DataFrame(data=arreglos,columns=["Nombre","Raza","Color","Altura","Peso","Nacimiento"])
df["Altura"]= df["Altura"].astype(int)
df["Peso"]= df["Peso"].astype(int)
df

    Nombre          Raza   Color  Altura  Peso  Nacimiento
0    Bella      Labrador    Café      56    24  2013-07-01
1  Charlie        Poodle   Negro      56    24  2016_09_16
2     Lucy     Chow Chow    Café      46    24  2014-08-25
3   Cooper     Schnauzer    Gris      49    17  2011-12-11
4   Bernie  San Bernardo  Blanco      77    74  2018-02-27

In [63]:
df2=df[df["Nacimiento"]<"2015-01-01"]
df2

   Nombre       Raza Color  Altura  Peso  Nacimiento
0   Bella   Labrador  Café      56    24  2013-07-01
2    Lucy  Chow Chow  Café      46    24  2014-08-25
3  Cooper  Schnauzer  Gris      49    17  2011-12-11

In [65]:
df[df["Altura"]>50]

    Nombre          Raza   Color  Altura  Peso  Nacimiento
0    Bella      Labrador    Café      56    24  2013-07-01
1  Charlie        Poodle   Negro      56    24  2016_09_16
4   Bernie  San Bernardo  Blanco      77    74  2018-02-27

In [67]:
# nueva columna con IMM de los perros

df["IMM"]=df["Peso"]/(df["Altura"]/100)**2
df

    Nombre          Raza   Color  Altura  Peso  Nacimiento         IMM
0    Bella      Labrador    Café      56    24  2013-07-01   76.530612
1  Charlie        Poodle   Negro      56    24  2016_09_16   76.530612
2     Lucy     Chow Chow    Café      46    24  2014-08-25  113.421550
3   Cooper     Schnauzer    Gris      49    17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco      77    74  2018-02-27  124.810255

In [71]:
df2=df[["Nombre","Raza", "IMM"]]
df2

    Nombre          Raza         IMM
0    Bella      Labrador   76.530612
1  Charlie        Poodle   76.530612
2     Lucy     Chow Chow  113.421550
3   Cooper     Schnauzer   70.803832
4   Bernie  San Bernardo  124.810255

In [75]:
df2= df2.sort_values("IMM",ascending=True)
df2

    Nombre          Raza         IMM
3   Cooper     Schnauzer   70.803832
0    Bella      Labrador   76.530612
1  Charlie        Poodle   76.530612
2     Lucy     Chow Chow  113.421550
4   Bernie  San Bernardo  124.810255